amcelroy/ra-pac/svd_patch/R7FA6M4AF.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>MSTP</name>
            <description>Module Stop Control</description>
            <baseAddress>0x40084000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>MSTPCRA</name>
                    <description>Module Stop Control Register A</description>
                    <addressOffset>0x000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xffbfff7e</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>MSTPA0</name>
                            <description>SRAM0 Module Stop</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPA7</name>
                            <description>Standby SRAM Module Stop</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPA22</name>
                            <description>DMA Controller/Data Transfer Controller Module Stop</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSTPCRB</name>
                    <description>Module Stop Control Register B</description>
                    <addressOffset>0x004</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xffffffff</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>MSTPB1</name>
                            <description>Controller Area Network 1 Module Stop</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB2</name>
                            <description>Controller Area Network 0 Module Stop</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB6</name>
                            <description>Quad Serial Peripheral Interface Module Stop</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB8</name>
                            <description>I2C Bus Interface 1 Module Stop</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB9</name>
                            <description>I2C Bus Interface 0 Module Stop</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB11</name>
                            <description>Universal Serial Bus 2.0 FS Interface 0 Module Stop</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB15</name>
                            <description>ETHERC0 and EDMAC0 Module Stop</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB16</name>
                            <description>OSPI Module Stop</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB18</name>
                            <description>Serial Peripheral Interface 1 Module Stop</description>
                            <lsb>18</lsb>
                            <msb>18</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB19</name>
                            <description>Serial Peripheral Interface 0 Module Stop</description>
                            <lsb>19</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB22</name>
                            <description>Serial Communication Interface 9 Module Stop</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB23</name>
                            <description>Serial Communication Interface 8 Module Stop</description>
                            <lsb>23</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB24</name>
                            <description>Serial Communication Interface 7 Module Stop</description>
                            <lsb>24</lsb>
                            <msb>24</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB25</name>
                            <description>Serial Communication Interface 6 Module Stop</description>
                            <lsb>25</lsb>
                            <msb>25</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB26</name>
                            <description>Serial Communication Interface 5 Module Stop</description>
                            <lsb>26</lsb>
                            <msb>26</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB27</name>
                            <description>Serial Communication Interface 4 Module Stop</description>
                            <lsb>27</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB28</name>
                            <description>Serial Communication Interface 3 Module Stop</description>
                            <lsb>28</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB29</name>
                            <description>Serial Communication Interface 2 Module Stop</description>
                            <lsb>29</lsb>
                            <msb>29</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB30</name>
                            <description>Serial Communication Interface 1 Module Stop</description>
                            <lsb>30</lsb>
                            <msb>30</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPB31</name>
                            <description>Serial Communication Interface 0 Module Stop</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSTPCRC</name>
                    <description>Module Stop Control Register C</description>
                    <addressOffset>0x008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xffffffff</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>MSTPC0</name>
                            <description>Clock Frequency Accuracy Measurement Circuit Module Stop</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC1</name>
                            <description>Cyclic Redundancy Check Calculator Module Stop</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC3</name>
                            <description>Capacitive Touch Sensing Unit Module Stop</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC8</name>
                            <description>Serial Sound Interface Enhanced Module Stop</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC12</name>
                            <description>Secure Digital HOST IF / Multi Media Card 0 Module Stop</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC13</name>
                            <description>Data Operation Circuit Module Stop</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC14</name>
                            <description>Event Link Controller Module Stop</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPC31</name>
                            <description>SCE9 Module Stop</description>
                            <lsb>31</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MSTPCRD</name>
                    <description>Module Stop Control Register D</description>
                    <addressOffset>0x00C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xffffffff</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>MSTPD0</name>
                            <description>Low Power Asynchronous General Purpose Timer 3 Module Stop</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD1</name>
                            <description>Low Power Asynchronous General Purpose Timer 2 Module Stop</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD2</name>
                            <description>Low Power Asynchronous General Purpose Timer 1 Module Stop</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD3</name>
                            <description>Low Power Asynchronous General Purpose Timer 0 Module Stop</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD11</name>
                            <description>Port Output Enable for GPT Group D Module Stop</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD12</name>
                            <description>Port Output Enable for GPT Group C Module Stop</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD13</name>
                            <description>Port Output Enable for GPT Group B Module Stop</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD14</name>
                            <description>Port Output Enable for GPT Group A Module Stop</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD15</name>
                            <description>12-bit A/D Converter 1 Module Stop</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD16</name>
                            <description>12-bit A/D Converter 0 Module Stop</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD20</name>
                            <description>12-bit D/A Converter Module Stop</description>
                            <lsb>20</lsb>
                            <msb>20</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTPD22</name>
                            <description>Temperature Sensor Module Stop</description>
                            <lsb>22</lsb>
                            <msb>22</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
