amcelroy/ra-pac/svd_patch/R7FA6M4AF.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="AGT0">
            <name>AGT1</name>
            <description>Low Power Asynchronous General Purpose Timer 1</description>
            <baseAddress>0x400E8100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="AGT0">
            <name>AGT2</name>
            <description>Low Power Asynchronous General Purpose Timer 2</description>
            <baseAddress>0x400E8200</baseAddress>
        </peripheral>
        <peripheral derivedFrom="AGT0">
            <name>AGT3</name>
            <description>Low Power Asynchronous General Purpose Timer 3</description>
            <baseAddress>0x400E8300</baseAddress>
        </peripheral>
        <peripheral derivedFrom="AGT0">
            <name>AGT4</name>
            <description>Low Power Asynchronous General Purpose Timer 4</description>
            <baseAddress>0x400E8400</baseAddress>
        </peripheral>
        <peripheral derivedFrom="AGT0">
            <name>AGT5</name>
            <description>Low Power Asynchronous General Purpose Timer 5</description>
            <baseAddress>0x400E8500</baseAddress>
        </peripheral>
        <peripheral>
            <name>TSN</name>
            <description>Temperature Sensor</description>
            <baseAddress>0x400F3000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>TSCR</name>
                    <description>Temperature Sensor Control Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>TSOE</name>
                            <description>Temperature Sensor Output Enable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>TSEN</name>
                            <description>Temperature Sensor Enable</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>CRC</name>
            <description>Cyclic Redundancy Check Calculator</description>
            <baseAddress>0x40108000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>1</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x04</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x08</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CRCCR0</name>
                    <description>CRC Control Register 0</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>GPS</name>
                            <description>CRC Generating Polynomial Switching</description>
                            <lsb>0</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>LMS</name>
                            <description>CRC Calculation Switching</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                        <field>
                            <name>DORCLR</name>
                            <description>CRCDOR/CRCDOR_HA/CRCDOR_BY Register Clear</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>write-only</access>
                            <enumeratedValues>
                                </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CRCDIR</name>
                    <description>CRC Data Input Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                </register>
                <register>
                    <name>CRCDIR_BY</name>
                    <description>CRC Data Input Register</description>
                    <alternateRegister>CRCDIR</alternateRegister>
                    <addressOffset>0x04</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                </register>
                <register>
                    <name>CRCDOR</name>
                    <description>CRC Data Output Register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                </register>
                <register>
                    <name>CRCDOR_HA</name>
                    <description>CRC Data Output Register</description>
                    <alternateRegister>CRCDOR</alternateRegister>
                    <addressOffset>0x08</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CRCDOR_BY</name>
                    <description>CRC Data Output Register</description>
                    <alternateRegister>CRCDOR</alternateRegister>
                    <addressOffset>0x08</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                </register>
